bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/atdf/ATSAMC21E15A.atdf
      <value-group name="WDT_CONFIG__WINDOW">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="WDT_EWCTRL__EWOFFSET">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
    <value-group caption="Bootloader Size" name="NVMCTRL_BOOTPROT"><value caption="32768 Bytes" name="SIZE_32768BYTES" value="0x00"/><value caption="16384 Bytes" name="SIZE_16384BYTES" value="0x01"/><value caption="8192 Bytes" name="SIZE_8192BYTES" value="0x02"/><value caption="4096 Bytes" name="SIZE_4096BYTES" value="0x03"/><value caption="2048 Bytes" name="SIZE_2048BYTES" value="0x04"/><value caption="1024 Bytes" name="SIZE_1024BYTES" value="0x05"/><value caption="512 Bytes" name="SIZE_512BYTES" value="0x06"/><value caption="0 Bytes" name="SIZE_0BYTES" value="0x07"/></value-group><value-group caption="EEPROM Size" name="NVMCTRL_EEPROM_SIZE"><value caption="16384 Bytes" name="SIZE_16384BYTES" value="0x00"/><value caption="8192 Bytes" name="SIZE_8192BYTES" value="0x01"/><value caption="4096 Bytes" name="SIZE_4096BYTES" value="0x02"/><value caption="2048 Bytes" name="SIZE_2048BYTES" value="0x03"/><value caption="1024 Bytes" name="SIZE_1024BYTES" value="0x04"/><value caption="512 Bytes" name="SIZE_512BYTES" value="0x05"/><value caption="256 Bytes" name="SIZE_256BYTES" value="0x06"/><value caption="0 Bytes" name="SIZE_0BYTES" value="0x07"/></value-group><value-group caption="BODVDD Disable" name="BODVDD_DIS"><value caption="BODVDD is disabled" name="DISABLED" value="0x00"/><value caption="BODVDD is enableD" name="ENABLED" value="0x01"/></value-group><value-group caption="BODVDD Disable" name="BODVDD_ACTION"><value caption="No action" name="NONE" value="0x00"/><value caption="BODVDD generates a reset" name="RESET" value="0x01"/><value caption="BODVDD generates an interrupt" name="INT" value="0x02"/></value-group><value-group caption="WDT Enable" name="WDT_ENABLE"><value caption="WDT is disabled" name="DISABLED" value="0x00"/><value caption="WDT is enabled" name="ENABLED" value="0x01"/></value-group><value-group caption="WDT Always On" name="WDT_ALWAYSON"><value caption="WDT is enabled and disabled through ENABLE bit" name="DISABLED" value="0x00"/><value caption="WDT is enabled and can only be disabled by a power-on reset" name="ENABLED" value="0x01"/></value-group><value-group caption="WDT Period" name="WDT_PER"><value caption="8 clock cycles" name="CYC8" value="0x00"/><value caption="16 clock cycles" name="CYC16" value="0x01"/><value caption="32 clock cycles" name="CYC32" value="0x02"/><value caption="64 clock cycles" name="CYC64" value="0x03"/><value caption="128 clock cycles" name="CYC128" value="0x04"/><value caption="256 clock cycles" name="CYC256" value="0x05"/><value caption="512 clock cycles" name="CYC512" value="0x06"/><value caption="1024 clock cycles" name="CYC1024" value="0x07"/><value caption="2048 clock cycles" name="CYC2048" value="0x08"/><value caption="4096 clock cycles" name="CYC4096" value="0x09"/><value caption="8192 clock cycles" name="CYC8192" value="0x0A"/><value caption="16384 clock cycles" name="CYC16384" value="0x0B"/></value-group><value-group caption="WDT Window" name="WDT_WINDOW"><value caption="8 clock cycles" name="CYC8" value="0x00"/><value caption="16 clock cycles" name="CYC16" value="0x01"/><value caption="32 clock cycles" name="CYC32" value="0x02"/><value caption="64 clock cycles" name="CYC64" value="0x03"/><value caption="128 clock cycles" name="CYC128" value="0x04"/><value caption="256 clock cycles" name="CYC256" value="0x05"/><value caption="512 clock cycles" name="CYC512" value="0x06"/><value caption="1024 clock cycles" name="CYC1024" value="0x07"/><value caption="2048 clock cycles" name="CYC2048" value="0x08"/><value caption="4096 clock cycles" name="CYC4096" value="0x09"/><value caption="8192 clock cycles" name="CYC8192" value="0x0A"/><value caption="16384 clock cycles" name="CYC16384" value="0x0B"/></value-group><value-group caption="WDT Early Warning Offset" name="WDT_EWOFFSET"><value caption="8 clock cycles" name="CYC8" value="0x00"/><value caption="16 clock cycles" name="CYC16" value="0x01"/><value caption="32 clock cycles" name="CYC32" value="0x02"/><value caption="64 clock cycles" name="CYC64" value="0x03"/><value caption="128 clock cycles" name="CYC128" value="0x04"/><value caption="256 clock cycles" name="CYC256" value="0x05"/><value caption="512 clock cycles" name="CYC512" value="0x06"/><value caption="1024 clock cycles" name="CYC1024" value="0x07"/><value caption="2048 clock cycles" name="CYC2048" value="0x08"/><value caption="4096 clock cycles" name="CYC4096" value="0x09"/><value caption="8192 clock cycles" name="CYC8192" value="0x0A"/><value caption="16384 clock cycles" name="CYC16384" value="0x0B"/></value-group><value-group caption="WDT Window Mode Enable" name="WDT_WEN"><value caption="Window mode is disabled" name="DISABLED" value="0x00"/><value caption="Window mode is enabled" name="ENABLED" value="0x01"/></value-group><value-group caption="BODVDD Hysterisis" name="BODVDD_HYST"><value caption="No hysteresis" name="DISABLED" value="0x00"/><value caption="Hysteresis enabled" name="ENABLED" value="0x01"/></value-group></module>
    <module name="OSCCTRL" id="U2119" version="2.1.0" caption="Oscillators Control">
      <register-group name="OSCCTRL" caption="Oscillators Control">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="XOSCRDY" caption="XOSC Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="XOSCFAIL" caption="XOSC Clock Failure Detector Interrupt Enable" mask="0x2"/>
          <bitfield name="OSC48MRDY" caption="OSC48M Ready Interrupt Enable" mask="0x10"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise Interrupt Enable" mask="0x100"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall Interrupt Enable" mask="0x200"/>
          <bitfield name="DPLLLTO" caption="DPLL Time Out Interrupt Enable" mask="0x400"/>
          <bitfield name="DPLLLDRTO" caption="DPLL Ratio Ready Interrupt Enable" mask="0x800"/>
        </register>
