bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/atdf/ATSAMC21E15A.atdf
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready Interrupt Enable" mask="0x2"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detector Interrupt Enable" mask="0x4"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x1"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready" mask="0x2"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detector" mask="0x4"/>
        </register>
        <register name="STATUS" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Power and Clocks Status">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x1"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready" mask="0x2"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detector" mask="0x4"/>
          <bitfield name="CLKSW" caption="XOSC32K Clock switch" mask="0x8"/>
        </register>
        <register name="RTCCTRL" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Clock selection">
          <bitfield name="RTCSEL" caption="RTC Clock Selection" mask="0x7" values="OSC32KCTRL_RTCCTRL__RTCSEL"/>
        </register>
        <register name="XOSC32K" offset="0x14" rw="RW" size="2" initval="0x0080" caption="32kHz External Crystal Oscillator (XOSC32K) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="XTALEN" caption="Crystal Oscillator Enable" mask="0x4"/>
          <bitfield name="EN32K" caption="32kHz Output Enable" mask="0x8"/>
          <bitfield name="EN1K" caption="1kHz Output Enable" mask="0x10"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="STARTUP" caption="Oscillator Start-Up Time" mask="0x700" values="OSC32KCTRL_XOSC32K__STARTUP"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x1000"/>
        </register>
        <register name="CFDCTRL" offset="0x16" rw="RW" size="1" initval="0x00" caption="Clock Failure Detector Control">
          <bitfield name="CFDEN" caption="Clock Failure Detector Enable" mask="0x1"/>
          <bitfield name="SWBACK" caption="Clock Switch Back" mask="0x2"/>
          <bitfield name="CFDPRESC" caption="Clock Failure Detector Prescaler" mask="0x4"/>
        </register>
        <register name="EVCTRL" offset="0x17" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="CFDEO" caption="Clock Failure Detector Event Output Enable" mask="0x1"/>
        </register>
        <register name="OSC32K" offset="0x18" rw="RW" size="4" initval="0x003F0080" caption="32kHz Internal Oscillator (OSC32K) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="EN32K" caption="32kHz Output Enable" mask="0x4"/>
          <bitfield name="EN1K" caption="1kHz Output Enable" mask="0x8"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="STARTUP" caption="Oscillator Start-Up Time" mask="0x700" values="OSC32KCTRL_OSC32K__STARTUP"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x1000"/>
          <bitfield name="CALIB" caption="Oscillator Calibration" mask="0x7F0000"/>
        </register>
        <register name="OSCULP32K" offset="0x1C" rw="RW" size="4" caption="32kHz Ultra Low Power Internal Oscillator (OSCULP32K) Control">
          <bitfield name="CALIB" caption="Oscillator Calibration" mask="0x1F00"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x8000"/>
        </register>
      </register-group>
      <value-group name="OSC32KCTRL_RTCCTRL__RTCSEL">
        <value name="ULP1K" caption="1.024kHz from 32kHz internal ULP oscillator" value="0"/>
        <value name="ULP32K" caption="32.768kHz from 32kHz internal ULP oscillator" value="1"/>
        <value name="OSC1K" caption="1.024kHz from 32.768kHz internal oscillator" value="2"/>
        <value name="OSC32K" caption="32.768kHz from 32.768kHz internal oscillator" value="3"/>
        <value name="XOSC1K" caption="1.024kHz from 32.768kHz internal oscillator" value="4"/>
        <value name="XOSC32K" caption="32.768kHz from 32.768kHz external crystal oscillator" value="5"/>
      </value-group>
      <value-group name="OSC32KCTRL_XOSC32K__STARTUP">
        <value name="CYCLE1" caption="0.122 ms" value="0"/>
        <value name="CYCLE32" caption="1.068 ms" value="1"/>
        <value name="CYCLE2048" caption="62.6 ms" value="2"/>
        <value name="CYCLE4096" caption="125 ms" value="3"/>
        <value name="CYCLE16384" caption="500 ms" value="4"/>
        <value name="CYCLE32768" caption="1000 ms" value="5"/>
        <value name="CYCLE65536" caption="2000 ms" value="6"/>
        <value name="CYCLE131072" caption="4000 ms" value="7"/>
      </value-group>
      <value-group name="OSC32KCTRL_OSC32K__STARTUP">
        <value name="CYCLE3" caption="0.092 ms" value="0"/>
        <value name="CYCLE4" caption="0.122 ms" value="1"/>
        <value name="CYCLE6" caption="0.183 ms" value="2"/>
        <value name="CYCLE10" caption="0.305 ms" value="3"/>
        <value name="CYCLE18" caption="0.549 ms" value="4"/>
        <value name="CYCLE34" caption="1.038 ms" value="5"/>
        <value name="CYCLE66" caption="2.014 ms" value="6"/>
        <value name="CYCLE130" caption="3.967 ms" value="7"/>
      </value-group>
    </module>
    <module name="PAC" id="U2120" version="1.1.0" caption="Peripheral Access Controller">
      <register-group name="PAC" caption="Peripheral Access Controller">
        <register name="WRCTRL" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Write control">
          <bitfield name="PERID" caption="Peripheral identifier" mask="0xFFFF"/>
          <bitfield name="KEY" caption="Peripheral access control key" mask="0xFF0000" values="PAC_WRCTRL__KEY"/>
        </register>
        <register name="EVCTRL" offset="0x4" rw="RW" size="1" initval="0x00" caption="Event control">
          <bitfield name="ERREO" caption="Peripheral acess error event output" mask="0x1"/>
        </register>
