bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/atdf/ATSAMC21E15A.atdf
        <register modes="I2CS" name="SYNCBUSY" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="I2CS Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="SERCOM Enable Synchronization Busy" mask="0x2"/>
        </register>
        <register modes="SPIM" name="SYNCBUSY" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="SPIM Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="SERCOM Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4"/>
        </register>
        <register modes="SPIS" name="SYNCBUSY" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="SPIS Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="SERCOM Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4"/>
        </register>
        <register modes="USART_EXT" name="SYNCBUSY" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="USART_EXT Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="SERCOM Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4"/>
        </register>
        <register modes="USART_INT" name="SYNCBUSY" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="USART_INT Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="SERCOM Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4"/>
        </register>
        <register modes="I2CM" name="ADDR" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="I2CM Address">
          <bitfield name="ADDR" caption="Address Value" mask="0x7FF"/>
          <bitfield name="LENEN" caption="Length Enable" mask="0x2000"/>
          <bitfield name="HS" caption="High Speed Mode" mask="0x4000"/>
          <bitfield name="TENBITEN" caption="Ten Bit Addressing Enable" mask="0x8000"/>
          <bitfield name="LEN" caption="Length" mask="0xFF0000"/>
        </register>
        <register modes="I2CS" name="ADDR" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="I2CS Address">
          <bitfield name="GENCEN" caption="General Call Address Enable" mask="0x1"/>
          <bitfield name="ADDR" caption="Address Value" mask="0x7FE"/>
          <bitfield name="TENBITEN" caption="Ten Bit Addressing Enable" mask="0x8000"/>
          <bitfield name="ADDRMASK" caption="Address Mask" mask="0x7FE0000"/>
        </register>
        <register modes="SPIM" name="ADDR" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="SPIM Address">
          <bitfield name="ADDR" caption="Address Value" mask="0xFF"/>
          <bitfield name="ADDRMASK" caption="Address Mask" mask="0xFF0000"/>
        </register>
        <register modes="SPIS" name="ADDR" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="SPIS Address">
          <bitfield name="ADDR" caption="Address Value" mask="0xFF"/>
          <bitfield name="ADDRMASK" caption="Address Mask" mask="0xFF0000"/>
        </register>
        <register modes="I2CM" name="DATA" offset="0x28" rw="RW" size="1" initval="0x00" caption="I2CM Data">
          <bitfield name="DATA" caption="Data Value" mask="0xFF"/>
        </register>
        <register modes="I2CS" name="DATA" offset="0x28" rw="RW" size="1" initval="0x00" caption="I2CS Data">
          <bitfield name="DATA" caption="Data Value" mask="0xFF"/>
        </register>
        <register modes="SPIM" name="DATA" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="SPIM Data">
          <bitfield name="DATA" caption="Data Value" mask="0x1FF"/>
        </register>
        <register modes="SPIS" name="DATA" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="SPIS Data">
          <bitfield name="DATA" caption="Data Value" mask="0x1FF"/>
        </register>
        <register modes="USART_EXT" name="DATA" offset="0x28" rw="RW" size="2" initval="0x0000" caption="USART_EXT Data">
          <bitfield name="DATA" caption="Data Value" mask="0x1FF"/>
        </register>
        <register modes="USART_INT" name="DATA" offset="0x28" rw="RW" size="2" initval="0x0000" caption="USART_INT Data">
          <bitfield name="DATA" caption="Data Value" mask="0x1FF"/>
        </register>
        <register modes="I2CM" name="DBGCTRL" offset="0x30" rw="RW" size="1" initval="0x00" caption="I2CM Debug Control">
          <bitfield name="DBGSTOP" caption="Debug Mode" mask="0x1"/>
        </register>
        <register modes="SPIM" name="DBGCTRL" offset="0x30" rw="RW" size="1" initval="0x00" caption="SPIM Debug Control">
          <bitfield name="DBGSTOP" caption="Debug Mode" mask="0x1"/>
        </register>
        <register modes="SPIS" name="DBGCTRL" offset="0x30" rw="RW" size="1" initval="0x00" caption="SPIS Debug Control">
          <bitfield name="DBGSTOP" caption="Debug Mode" mask="0x1"/>
        </register>
        <register modes="USART_EXT" name="DBGCTRL" offset="0x30" rw="RW" size="1" initval="0x00" caption="USART_EXT Debug Control">
          <bitfield name="DBGSTOP" caption="Debug Mode" mask="0x1"/>
        </register>
        <register modes="USART_INT" name="DBGCTRL" offset="0x30" rw="RW" size="1" initval="0x00" caption="USART_INT Debug Control">
          <bitfield name="DBGSTOP" caption="Debug Mode" mask="0x1"/>
        </register>
      </register-group>
      <value-group name="SERCOM_I2CM_CTRLA__MODE">
        <value name="USART_EXT_CLK" caption="USART with external clock" value="0x0"/>
        <value name="USART_INT_CLK" caption="USART with internal clock" value="0x1"/>
        <value name="SPI_SLAVE" caption="SPI in slave operation" value="0x2"/>
        <value name="SPI_MASTER" caption="SPI in master operation" value="0x3"/>
        <value name="I2C_SLAVE" caption="I2C slave operation" value="0x4"/>
        <value name="I2C_MASTER" caption="I2C master operation" value="0x5"/>
      </value-group>
      <value-group name="SERCOM_I2CM_CTRLA__SDAHOLD">
        <value name="DISABLE" caption="Disabled" value="0x0"/>
        <value name="75NS" caption="50-100ns hold time" value="0x1"/>
        <value name="450NS" caption="300-600ns hold time" value="0x2"/>
        <value name="600NS" caption="400-800ns hold time" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_I2CM_CTRLA__SPEED">
        <value name="STANDARD_AND_FAST_MODE" caption="Standard Mode(Sm) Upto 100kHz and Fast Mode(Fm) Upto 400kHz " value="0x0"/>
        <value name="FASTPLUS_MODE" caption="Fast-mode Plus Upto 1MHz" value="0x1"/>
        <value name="HIGH_SPEED_MODE" caption="High-speed mode Upto 3.4MHz" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_I2CM_CTRLA__INACTOUT">
        <value name="DISABLE" caption="Disabled" value="0x0"/>
        <value name="55US" caption="5-6 SCL Time-Out(50-60us)" value="0x1"/>
        <value name="105US" caption="10-11 SCL Time-Out(100-110us)" value="0x2"/>
        <value name="205US" caption="20-21 SCL Time-Out(200-210us)" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLA__MODE">
        <value name="USART_EXT_CLK" caption="USART with external clock" value="0x0"/>
        <value name="USART_INT_CLK" caption="USART with internal clock" value="0x1"/>
        <value name="SPI_SLAVE" caption="SPI in slave operation" value="0x2"/>
        <value name="SPI_MASTER" caption="SPI in master operation" value="0x3"/>
        <value name="I2C_SLAVE" caption="I2C slave operation" value="0x4"/>
        <value name="I2C_MASTER" caption="I2C master operation" value="0x5"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLA__CPHA">
        <value name="LEADING_EDGE" caption="The data is sampled on a leading SCK edge and changed on a trailing SCK edge" value="0x0"/>
        <value name="TRAILING_EDGE" caption="The data is sampled on a trailing SCK edge and changed on a leading SCK edge" value="0x1"/>
      </value-group>
